Autodesk.Revit.DB.BRepBuilderGeometryId.InvalidGeometryId
Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
Since:
2016

Autodesk.Revit.DB.BRepBuilderGeometryId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BRepBuilderGeometryId.#ctor(Autodesk.Revit.DB.BRepBuilderGeometryId)
Copy constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BRepBuilderGeometryId
This class is used by the BRepBuilder class to identify objects it creates (faces, edges, etc.).
Remarks:
The user should use these ids to organize the calls to BRepBuilder methods (e.g., addLoop() takes a face id as input,
referring to a face that was previously added by a call to AddFace()). The ids are only valid while the BRepBuilder is in use.
Since:
2016